// মডিউল নাম্বার কুড়ি + ১। উড়ছে জাভাস্ক্রিপ্ট এর ঘুড়ি (মডিউল-২১)

// #module_release #basic_javascript_milestone #module_21

// খাইতে গেলাম মোগলাই 
// খেয়ে আসলাম রামধোলাই  
// কেন?
// কারণ করতে পারিনি লুপ আর ফাংশনরে এপ্লাই 
// তাই মাইর খাওয়ার আগে এগুলারে করতে হবে ঝালাই
// —------------------------ 

// Practice Problem PDF link:-
// https://drive.google.com/file/d/124tnpZWQ5e_6X2zifC8HE3ILe0bBuZba/view?usp=sharing
// —------------------------ 

// প্রাকটিস চ্যালেঞ্জ-৩ টা:- 

// ১. leapYear() নামে ফাংশন লিখো এবং নেক্সট ইয়ার অর্থাৎ ২০২৩ কি leap year নাকি সেটা চেক করো। Leap year হলে ফাংশন true রিটার্ন করবে আর leap year না হলে false রিটার্ন করবে।

function leapYear(){

}



// ২. তোমার বয়স কি odd নাকি even সংখ্যা সেটা চেক কর একটা ফাংশন দিয়ে। সেই ফাংশনকে কোন সংখ্যা প্যারামিটার হিসেবে দিলে, সেই সংখ্যা Even হলে ফাংশন true রিটার্ন করবে আর Odd হলে false রিটার্ন করবে।





// ৩. এমন একটা ফ্যাংশনা লিখো যেটাকে তুমি ঘন্টাকে ইনপুট প্যারামিটার হিসেবে দিবে। আর সে সেই ঘন্টাকে মিনিটে কনভার্ট করে মিনিট রিটার্ন করবে। 

// —---------------------