// স্ট্রিং:--

// প্রথমেই আছে স্ট্রিং রিলেটেড কয়েকটা জিনিস। সেই জিনিসগুলো তোমাকে জানতেই হবে। 
// ১. স্ট্রিং immutable 
// ২. স্ট্রিং এর length আছে 
// ৩. index অনুসারে string এর ভিতরের সব letter কে একসেস করা যায়। 
// ৪. for লুপ বা for of লুপ দিয়ে স্ট্রিং এর সব ক্যারেক্টার এর উপরে লুপ চালানো যায়। 
// ৫. toLowerCase এবং toUpperCase দিয়ে কোন স্ট্রিং কে সব ছোট হাতের বা সব বড় হাতের অক্ষর বানিয়ে ফেলা যায় 
// ৬. স্ট্রিং এর মধ্যে কোন এক বা একাধিক অক্ষর খুঁজতে চাইলে তুমি array এর মতো করে indexOf দিয়ে index চেক করতে পারো 
// ৭. স্ট্রিং এর মধ্যে এক বা একাধিক অক্ষর আছে কিনা সেটা includes দিয়েও চেক করতে পারো 
// ৮. এছাড়াও স্ট্রিং এর ছোট একটা অংশ বের করার জন্য split, slice, substring ইউজ করতে পারো 


// প্রবলেম তখনই প্রবলেম, যখন তুমি সেটা আঁকড়ে ধরে বসে থাকো । আর একবার সমাধান করে ফেলতে পারলে; প্রবলেম আর প্রবলেম থাকে না। সেটা নলেজ, স্কিল আর এক্সপেরিয়েন্স এ কনভার্ট হয়ে যায়।


// প্রাকটিস প্রব্লেম- ৫ খানা :

// ১. একটা কোড লিখো। যেটা দিয়ে কোন একটা array এর মধ্যে সবচেয়ে ছোট সংখ্যা বের করে দিতে পারবে। 





// ২. একটা কোড লিখো যেটা দিয়ে তিনটা সংখ্যার মধ্যে সবচেয়ে ছোট সংখ্যা বের করে দিবে।  






// ৩. একটা ফাংশন লিখো। সেই ফাংশনের মধ্যে ইনপুট হিসেবে একটা array নিবে। সেই array এর মধ্যে অনেকগুলা সংখ্যা থাকবে। তোমার কাজ হবে ইনপুট নেয়া array এর মধ্যে যতগুলা সংখ্যা আছে। সেই সংখ্যা গুলার গড় বের করবে। তারপর সেই গড় ফাংশনের রিটার্ন হিসেবে দিয়ে দিবে। একটু চিন্তা করো। বুঝার চেষ্টা করো। ট্রাই করো। দেখো পারো কিনা। 





// ৪. একটা ফাংশন লিখো। যেটা ইনপুট প্যারামিটার হিসেবে একটা আয়তক্ষেত্রের দৈর্ঘ্য আর উচ্চতাকে নিবে। তারপর সেই আয়তক্ষেত্র এর area (আয়তন) কে রেজাল্ট হিসেবে রিটার্ন করবে। 






// ৫. (ট্রিকি) কোন একটা array এর মধ্যে অনেকগুলা সংখ্যা আছে। সেই সংখ্যাগুলো থেকে second largest সংখ্যা বের করার একটা প্রোগ্রাম লিখো। দরকার হলে গুগলে সার্চ দাও। তারপর সার্চ রেজাল্ট দেখে বুঝে বুঝে করার চেষ্টা করো। 